// *++
//
// Copyright (c) 2004 - 2009, Intel Corporation
// All rights reserved. This program and the accompanying materials
// are licensed and made available under the terms and conditions of the BSD License
// which accompanies this distribution.  The full text of the license may be found at
// http://opensource.org/licenses/bsd-license.php
//
// THE PROGRAM IS DISTRIBUTED UNDER THE BSD LICENSE ON AN "AS IS" BASIS,
// WITHOUT WARRANTIES OR REPRESENTATIONS OF ANY KIND, EITHER EXPRESS OR IMPLIED.
//
// Module Name:
//
//   BootManagerStrings.uni
//
// Abstract:
//
//   String definitions for BootMgr.
//
// --*/

/=#

#langdef en-US "English"

#string STR_BM_BANNER_TMP                             #language en-US  ""
#string STR_BM_BANNER                                 #language en-US  "Boot manager"
#string STR_EFI_BOOT1                                 #language en-US  "*[ EFI-load ] "
#string STR_EFI_BOOT2                                 #language en-US  "[ Loading EFI from FS ] "
#string STR_HELP_FOOTER                               #language en-US  "Arrow keys to change option, ENTER to select an option, ESC to exit"
#string STR_BOOT_OPTION_BANNER                        #language en-US  "Boot Option Menu"
#string STR_LAST_STRING                               #language en-US  ""
#string STR_BOOT_FAILED                               #language en-US  "Boot Failed. "
#string STR_BOOT_SUCCEEDED                            #language en-US  "Boot Succeeded - "
#string STR_BOOT_CTRL_MENU                            #language en-US  "Boot menu"
#string STR_BOOT_CFG_MENU                             #language en-US  "Boot config"
#string STR_EDIT_BOOT_CFG                             #language en-US  "Edit boot config"
#string STR_BOOT_INTEGRITY                            #language en-US  "Integrity managment"
#string STR_BOOT_DEFAULT                              #language en-US  "Boot default"
#string STR_BOOT_FROM_FS                              #language en-US  "Boot from filesystem"
#string STR_BOOT_CFG_EXPORT                           #language en-US  "Export configuration"
#string STR_BOOT_CFG_IMPORT                           #language en-US  "Import configuration"
#string STR_BOOT_ADD_FILE                             #language en-US  "Add file to list"
#string STR_BOOT_SAVE_FILES_LIST                      #language en-US  "Save files list"
#string STR_SAVE_FILES_LIST_OK                        #language en-US  "Files list is saved"
#string STR_SAVE_FILES_LIST_ERR                       #language en-US  "Error while saving files list"
#string STR_FILE_ALLREADY_PRESENT_ERR                 #language en-US  "Error! File already exists in list."
#string STR_SAVE_CURRENT_BOOT_CFG                     #language en-US  "Save current boot config"
#string STR_BOOT_TYPE                                 #language en-US  "Boot type:"
#string STR_BOOT_TYPE_EFI                             #language en-US  "EFI_BOOT"
#string STR_BOOT_TYPE_FROM_FS                         #language en-US  "BOOT_FROM_FS"
#string STR_BOOT_TYPE_LEGACY                          #language en-US  "LEGACY_BOOT"
#string STR_BOOT_TYPE_DEFAULT                         #language en-US  "DEFAULT_BOOT"
#string STR_MODULE_MULTIBOOT_TYPE                     #language en-US  "Multiboot"
#string STR_MODULE_LINUX_TYPE                         #language en-US  "Linux"
#string STR_MODULE_EFI_TYPE                           #language en-US  "EFI"
#string STR_MODULE_LEGACY_TYPE                        #language en-US  "Legacy"
#string STR_MODULE_DEFAULT_TYPE                       #language en-US  "Default"
#string STR_ADD_MODULE                                #language en-US  "Add module"
#string STR_SAVE_CURR_CFG_ERR                         #language en-US  "Error while saving current config."
#string STR_SAVE_CURR_CFG_OK                          #language en-US  "Current config saved successfully."
#string STR_ADD_NEW_MODULE_ERR                        #language en-US  "Error while adding new module."
#string STR_WAIT_FOT_BM_START                         #language en-US  "Please wait while boot manager is starting up..."
#string STR_ERR_MAX_MODULES                           #language en-US  "Can't add new module, because current limit is 5!"
#string STR_CLEAN_MODULES_LIST                        #language en-US  "Clean modules list"
#string STR_DISABLE_KUEFI                             #language en-US  "Disable KUEFI"
#string STR_IMPORT_OK                                 #language en-US  "Configuration accepted!"
#string STR_ERR_OPEN_FILE                             #language en-US  "Error while opening file."
#string STR_ERR_SIZE_OF_FILE                          #language en-US  "Error while obtaining size of file!"
#string STR_ERR_MEM_ALLOC                             #language en-US  "Error while allocating memory!"
#string STR_ERR_XML_PARSE                             #language en-US  "Error! Unknown file format!"
#string STR_ERR_EXPORT                                #language en-US  "Error while exporting configuration."
#string STR_EXPORT_OK                                 #language en-US  "Export success!"
#string STR_UPDATE_DEVICES_LIST                       #language en-US  "Update list of devices"
#string STR_BOOT_MODE                                 #language en-US  "Boot mode"
#string STR_BOOT_MODE2                                #language en-US  "*[ Boot mode ] "
#string STR_NOT_SET                                   #language en-US  "Not set"
#string STR_BOOT_CLEAN_FILES_LIST                     #language en-US  "Clean files list"
#string STR_WAIT_FOT_DEV_LIST_UPDATING                #language en-US  "Please wait while updating devices list..."
#string STR_DESCRIPTION_FLOPPY                        #language en-US  "EFI Floppy"
#string STR_DESCRIPTION_CD_DVD                        #language en-US  "EFI DVD/CDROM"
#string STR_DESCRIPTION_HARD_DRIVE                    #language en-US  "EFI Hard Drive"
#string STR_DESCRIPTION_USB                           #language en-US  "EFI USB Device"
#string STR_DESCRIPTION_SCSI                          #language en-US  "EFI SCSI Device"
#string STR_DESCRIPTION_MISC                          #language en-US  "EFI Misc Device"
#string STR_DESCRIPTION_NETWORK                       #language en-US  "EFI Network"
#string STR_DESCRIPTION_NON_BLOCK                     #language en-US  "EFI Non-Block Boot Device"
#string STR_LEGACY_BOOT                               #language en-US  "*[ Legacy-load ] "
#string STR_REFRESH_FILES_LIST                        #language en-US  "Refresh files list hash"
#string STR_ERROR_OBJECT_NOT_FOUND                    #language en-US  "Error! Object not found!"
#string STR_PRESS_ENTER_TO_REMOVE_ITEM                #language en-US  "\n<Press ENTER to remove this item>"
#string STR_DEV_PATH_NOT_FOUND			              #language en-US "Error! Device path not found!"
#string STR_MODULE          			              #language en-US "Module"
#string STR_DEV_PATH          			              #language en-US "Device path"
#string STR_ARGS            			              #language en-US "Args"
#string STR_BOOT_CFG_IMPORT_PLS_WAIT                  #language en-US  "Import configuration, please wait..."
#string STR_PLEASE_INSERT_FLASH_IN_PROPER_PORT        #language en-US "Please, insert flash into proper USB-port"
#string STR_ABSENT_DEVICES_WITH_FS                    #language en-US "No drives supported file systems!"
#string STR_WARN_CANNT_UPDATE_HASH                    #language en-US  "Warning: can't update hash"
